Tekla.Structures.ModelInternal.HistoryItem
Stores info about history change.

Tekla.Structures.ModelInternal.HistoryItem.Id
Object identifier. Must be unique.

Tekla.Structures.ModelInternal.HistoryItem.Guid
ModelObject guid, if applicable.

Tekla.Structures.ModelInternal.HistoryItem.Action
What happened to the object.

Tekla.Structures.ModelInternal.HistoryItem.Name
Object name.

Tekla.Structures.ModelInternal.HistoryItem.Type
Object type.

Tekla.Structures.ModelInternal.HistoryItem.User
User who changed last.

Tekla.Structures.ModelInternal.HistoryItem.InternalName
Internal name for some tabs (UDA)

Tekla.Structures.ModelInternal.HistoryItem.DrawingMark
For drawings: drawing mark

Tekla.Structures.ModelInternal.HistoryItem.ObjectInstance
For access to model object

Tekla.Structures.ModelInternal.HistoryItem.Time
The time when change was made.